
&НаКлиенте
Процедура ЗагрузитьКартинку(Команда)
	Оповещение  = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект);
	Начатьпомещениефайла(Оповещение,,,Истина, УникальныйИдентификатор); 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеКартинки");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда 
		ТекущийОбъект.ДанныеКартинки = Новый  ХранилищеЗначения(ПолучитьИзВременногоХранилища(СсылкаНаКартинку)); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмя, ДополнительныйПараметр) Экспорт
	Если не Результат Тогда 
		Возврат
	КонецЕсли;
	СсылкаНаКартинку = Адрес;//
КонецПроцедуры

