
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	НДФЛ = 13; 
	
	Движения.ОсновныеНачисления.Записывать = Истина;
	Движения.Удержания.Записывать = Истина;
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыОсновныеНачисления.ГрафикРаботы КАК ГрафикРаботы,
		|	НачислениеЗарплатыОсновныеНачисления.Ссылка.Месяц КАК Месяц
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	Документ.НачислениеЗарплаты.ОсновныеНачисления КАК НачислениеЗарплатыОсновныеНачисления
		|ГДЕ
		|	НачислениеЗарплатыОсновныеНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ГрафикиРаботы.Дней) КАК ОтпускДней,
		|	ГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
		|	ОтпускаСотрудников.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_Отпуск
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтпускаСотрудников КАК ОтпускаСотрудников
		|		ПО (ГрафикиРаботы.Дата МЕЖДУ ОтпускаСотрудников.ДатаНачала И ОтпускаСотрудников.ДатаОкончания)
		|ГДЕ
		|	ГрафикиРаботы.Дата МЕЖДУ &НП И &КП
		|	И (ОтпускаСотрудников.ДатаНачала МЕЖДУ &НП И &КП
		|			ИЛИ ОтпускаСотрудников.ДатаОкончания МЕЖДУ &НП И &КП)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикиРаботы.ГрафикРаботы,
		|	ОтпускаСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
		|	СУММА(ГрафикиРаботы.Дней) КАК Дней
		|ПОМЕСТИТЬ ВТ_Графики
		|ИЗ
		|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
		|ГДЕ
		|	ГрафикиРаботы.Дата МЕЖДУ &НП И &КП
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрафикиРаботы.ГрафикРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(УсловияОплатыСотрудниковСрезПоследних.Оклад, 0) КАК Оклад,
		|	ВТ_Документ.Сотрудник КАК Сотрудник,
		|	ВТ_Документ.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТ_Документ.Месяц КАК Месяц,
		|	ВТ_Графики.Дней КАК ОтработаноДней,
		|	ЕСТЬNULL(ВТ_Отпуск.ОтпускДней, 0) КАК ОтпускДней
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияОплатыСотрудников.СрезПоследних(&МоментВремени, ) КАК УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_Документ.Сотрудник = УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Графики КАК ВТ_Графики
		|		ПО ВТ_Документ.ГрафикРаботы = ВТ_Графики.ГрафикРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Отпуск КАК ВТ_Отпуск
		|		ПО ВТ_Документ.ГрафикРаботы = ВТ_Отпуск.ГрафикРаботы
		|			И ВТ_Документ.Сотрудник = ВТ_Отпуск.Сотрудник";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("НП", Месяц);
	Запрос.УстановитьПараметр("КП", КонецМесяца(Месяц));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
			
		Отпускные = 0;
		ОтработаноДней = Выборка.ОтработаноДней - Выборка.ОтпускДней;
		
		Оклад = ?(Выборка.ОтработаноДней = 0, 0, ОтработаноДней*Выборка.Оклад/Выборка.ОтработаноДней);
			
		// Оклад
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад;
		Движение.ПериодРегистрации = Выборка.Месяц;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Результат = Оклад;
		Движение.ОтработаноДней = ОтработаноДней;
		Движение.ГрафикРаботы = Выборка.ГрафикРаботы;
		Движение.Оклад = Выборка.Оклад;
		Движение.РабочихДней = Выборка.ОтработаноДней;
		
		// начисление на отпуск
		Если Выборка.ОтпускДней > 0 Тогда
					
			Отпускные = ПолучитьСуммуВДеньОтпускныхПоСотруднику(Выборка.Сотрудник) * Выборка.ОтпускДней;
			
			Движение = Движения.ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Отпускные;
			Движение.ПериодРегистрации = Выборка.Месяц;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.Результат = Отпускные;
			
		КонецЕсли;
				
		КОплатеСотруднику = Оклад + Отпускные;
		НДФЛСумма = КОплатеСотруднику * (НДФЛ/100);
		КОплатеСотруднику = КОплатеСотруднику - НДФЛСумма; 
		
		// взаиморасчеты
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = КОплатеСотруднику; 
		
		// расчитать НДФЛ 
		Движение = Движения.Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Результат = НДФЛСумма;
		
	КонецЦикла;

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСуммуВДеньОтпускныхПоСотруднику(Сотрудник)
	
	Сумма = 0;
	РабочихДней = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ОсновныеНачисления.Результат) КАК Результат,
		|	СУММА(ОсновныеНачисления.РабочихДней) КАК РабочихДней
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
		|ГДЕ
		|	ОсновныеНачисления.Сотрудник = &Сотрудник
		|	И ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НП И &КП";
	
	Запрос.УстановитьПараметр("НП", ДобавитьМесяц(Месяц, -12));
	Запрос.УстановитьПараметр("КП", Месяц);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сумма = Сумма + ?(ЗначениеЗаполнено(Выборка.Результат), Выборка.Результат,0);;
		РабочихДней = РабочихДней + ?(ЗначениеЗаполнено(Выборка.РабочихДней), Выборка.РабочихДней,0);
	КонецЦикла;                                                                                              
	
	Результат = ?(РабочихДней = 0, 0, Сумма/РабочихДней); 
	
	Возврат Результат;
		
КонецФункции 

#КонецОбласти

#КонецЕсли
