 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодсветитьСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодсветитьСтроки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	ПодсветитьСтроки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("Сотрудник", Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник);
	
	ОткрытьФорму("Документ.ГрафикиОтпусков.Форма.АнализГрафика", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	ОтборУО = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУО.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.ПодсвечиватьСтроку");
	ОтборУО.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборУО.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	
КонецПроцедуры

Процедура ПодсветитьСтроки()
	
	ТЧСотрудникиОбщие = Новый ТаблицаЗначений;
	ТЧСотрудникиОбщие.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ТЧСотрудникиОбщие.Колонки.Добавить("СуммаДней", Новый ОписаниеТипов("Число"));
	
	Для Каждого Стр Из Объект.ОтпускаСотрудников Цикл
		
		ДанныеПоиска = Новый Структура;
		ДанныеПоиска.Вставить("Сотрудник", Стр.Сотрудник);
		
		СписокСтрокИтогов = ТЧСотрудникиОбщие.НайтиСтроки(ДанныеПоиска);
		
		Если СписокСтрокИтогов.Количество() = 0 Тогда
			СтрокаИтог = ТЧСотрудникиОбщие.Добавить();
			СтрокаИтог.Сотрудник = Стр.Сотрудник;
		Иначе
			Для Каждого СтрНайденная Из СписокСтрокИтогов Цикл
				СтрокаИтог = СтрНайденная;	
			КонецЦикла;
		КонецЕсли;
		
		СекундВДне = 60 * 60 * 24;
		РазницаВДнях = (Стр.ДатаОкончания - Стр.ДатаНачала) / СекундВДне;
		
		СтрокаИтог.СуммаДней = СтрокаИтог.СуммаДней + РазницаВДнях;
				
	КонецЦикла;
	
	Для Каждого Стр Из ТЧСотрудникиОбщие Цикл
		
		ПодсвечиватьСтроку = Стр.СуммаДней > 28;
		
		ДанныеПоиска = Новый Структура;
		ДанныеПоиска.Вставить("Сотрудник", Стр.Сотрудник);
		
		СписокСтрокСотрудника = Объект.ОтпускаСотрудников.НайтиСтроки(ДанныеПоиска);
		
		Для Каждого СтрТЧ Из СписокСтрокСотрудника Цикл
			СтрТЧ.ПодсвечиватьСтроку = ПодсвечиватьСтроку;	
		КонецЦикла;
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
 


