
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.Записать();
	
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
    Движения.Выручка.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка.Менеджер КАК Менеджер,
		|	РасходнаяНакладнаяСписокНоменклатуры.Количество КАК Количество,
		|	РасходнаяНакладнаяСписокНоменклатуры.Цена КАК Цена,
		|	РасходнаяНакладнаяСписокНоменклатуры.Сумма КАК Сумма,
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
		|ГДЕ
		|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документ.Номенклатура КАК Номенклатура,
		|	ВТ_Документ.Менеджер КАК Менеджер,
		|	ВТ_Документ.Количество КАК Количество,
		|	ВТ_Документ.Цена КАК Цена,
		|	ВТ_Документ.Сумма КАК Сумма,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ВТ_Документ.Склад КАК Склад,
		|	ВТ_Документ.Номенклатура.ЕдИзм КАК НоменклатураЕдИзм
		|ИЗ
		|	ВТ_Документ КАК ВТ_Документ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(&МоментВремени, ) КАК ОстаткиНоменклатурыОстатки
		|		ПО ВТ_Документ.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|			И ВТ_Документ.Склад = ОстаткиНоменклатурыОстатки.Склад";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Себестоимость = 0;
		
		Если Выборка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
			Если выборка.Количество > Выборка.КоличествоОстаток тогда
				Отказ = Истина; 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не хватает товара ""%1"" на складе ""%2"" в количестве %3 %4",
									Выборка.Номенклатура,
									Выборка.Склад,
									Выборка.Количество - Выборка.КоличествоОстаток,
									Выборка.НоменклатураЕдИзм);
				Сообщение.Сообщить();
				
			КонецЕсли;
			
			Если Отказ Тогда 
				Продолжить;
			КонецЕсли;
			
			// учет копеек
			Если Выборка.Количество = Выборка.КоличествоОстаток Тогда
				Себестоимость = Выборка.СуммаОстаток;	
			Иначе
				Себестоимость = ?(Выборка.КоличествоОстаток = 0, 0, Выборка.Количество * Выборка.СуммаОстаток / Выборка.КоличествоОстаток);
			КонецЕсли;
			
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Выборка.Склад;
			Движение.Количество = Выборка.Количество;
			Движение.Сумма = Себестоимость;
		КонецЕсли;
		
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Менеджер = Выборка.Менеджер;
		Движение.Сумма = Выборка.Сумма - Себестоимость;
		
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Менеджер = Выборка.Менеджер;
		Движение.Клиент = Контрагент; 
		Движение.Количество = Выборка.Количество;
		Движение.Себестоимость = Себестоимость;
		Движение.СуммаПродажи = Выборка.Сумма;
		Если Выборка.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
			Движение.Склад = Выборка.Склад;
		КонецЕсли;
	КонецЦикла;
	
	// регистр ЗадолженностиКлиентов Расход
	Движения.ЗадолженностиКлиентов.Записывать = Истина;
	Движение = Движения.ЗадолженностиКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Документ = Ссылка;
	Движение.Сумма = СуммаПоДокументу;
	
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Управленческий.КредитыИЗаймыВыданные;
	Движение.СчетКт = ПланыСчетов.Управленческий.Материалы;
	Движение.Период = Дата;
	Движение.СуммаРуб = СуммаПоДокументу;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры
