
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)      
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда 
		
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			
	КонецЕсли;
	
	ПользовательИБ.АутентификацияСтандартная = ДоступРазрешен; 
	ПользовательИБ.Имя = Логин; 
	ПользовательИБ.ПолноеИмя = Объект.Наименование;
	
	Если ПарольУстановлен Тогда
		ПользовательИБ.Пароль = Пароль;
	КонецЕсли;
	
	ПользовательИБ.Роли.Очистить(); 
	
	Если РольПользователя = Перечисления.Роли.Администратор Тогда 
		
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Администратор);
		
	ИначеЕсли РольПользователя = Перечисления.Роли.Директор Тогда 
		
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Директор);
	ИначеЕсли РольПользователя = Перечисления.Роли.Продавец Тогда 
		
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Продавец);
				
	КонецЕсли;
	
	ПользовательИБ.Записать();   
	
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
		

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект) 
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);   
	
	Если ПользовательИБ = Неопределено Тогда 		
		Возврат;		
	КонецЕсли;
	
   ДоступРазрешен = ПользовательИБ.АутентификацияСтандартная;
   Логин = ПользовательИБ.Имя; 
   
   Если ЗначениеЗаполнено(ПользовательИБ.СохраняемоеЗначениеПароля) Тогда 
	   	   
	   Пароль = "********";
	    
   КонецЕсли;
   
   ЭтоПолныеПрава = Ложь;
   ЭтоПолныеПраваБезДобавленияПользователей = Ложь;
   
   Для Каждого Роль из ПользовательИБ.Роли Цикл 
	   
	   Если Роль = Метаданные.Роли.Администратор Тогда    
		   РольПользователя = Перечисления.Роли.Администратор;
		   
	   ИначеЕсли Роль = Метаданные.Роли.Директор Тогда 		   
		   РольПользователя = Перечисления.Роли.Директор;
		   
	   ИначеЕсли Роль = Метаданные.Роли.Продавец Тогда 		   
		   РольПользователя = Перечисления.Роли.Продавец;
		   
	   КонецЕсли;
	      
   КонецЦикла;   
   	  	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент) 
	
	ПарольУстановлен = Истина;

КонецПроцедуры
