
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Контрагент;
		СуммаПлатежа = ДанныеЗаполнения.СуммаПоДокументу;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// регистр ЗадолженностиКлиентов Расход
	Движения.ЗадолженностиКлиентов.Записывать = Истина;
	Движение = Движения.ЗадолженностиКлиентов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Документ = ДокументОснование;
	Движение.Сумма = СуммаПлатежа; 
	
	Движения.ЗадолженностиКлиентов.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадолженностиКлиентовОстатки.Документ КАК Документ,
	|	ЗадолженностиКлиентовОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ЗадолженностиКлиентов.Остатки КАК ЗадолженностиКлиентовОстатки
	|ГДЕ
	|	ЗадолженностиКлиентовОстатки.Документ = &Документ
	|	И ЗадолженностиКлиентовОстатки.СуммаОстаток > 0";
	
	Запрос.УстановитьПараметр("Документ", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ДокументОбъект = ДокументОснование.ПолучитьОбъект();
		ДокументОбъект.СтатусЗаказа = Справочники.СтатусыЗаказов.Оплачен;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
	Движение.СчетКт = ПланыСчетов.Управленческий.КредитыИЗаймыВыданные;
	Движение.Период = Дата;
	Движение.СуммаРуб = СуммаПлатежа;
	Движение.СубконтоКТ[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Клиент;
	

	
КонецПроцедуры
