
&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ТоварыРеквПриИзмененииОбщее();		
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	ТоварыРеквПриИзмененииОбщее();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровСуммаПриИзменении(Элемент)
	ТоварыРеквПриИзмененииОбщее(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРеквПриИзмененииОбщее(ИзменениеСуммы = Ложь)
	
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если ИзменениеСуммы Тогда
		ТекДанные.Цена = ?(ТекДанные.Количество <> 0, ТекДанные.Сумма / ТекДанные.Количество, 0);
	Иначе
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;	
	ТекДанные.Цена = ПолучитьЦенуНоменклатуры(ТекДанные.Номенклатура);
	ТоварыРеквПриИзмененииОбщее();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	
	Возврат Вспомогательный.ПолучитьЦенуНоменклатуры(Номенклатура, Объект.ВидЦены, Объект.Дата);
	
КонецФункции

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаПодбораНоменклатуры",ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Для Каждого Стр Из Результат.СписокНоменклатуры Цикл
			СтрТЧ = Объект.СписокНоменклатуры.Добавить();
			СтрТЧ.Номенклатура = Стр;
			
			СтрТЧ.Цена = ПолучитьЦенуНоменклатуры(Стр);
				
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Объект.ВидЦены = Объект.Контрагент.ВидЦены;
	ПересчитатьЦенуПоВидамЦен();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	
	ПересчитатьЦенуПоВидамЦен();	
	
КонецПроцедуры 

&НаСервере
Процедура ПересчитатьЦенуПоВидамЦен()
	
	Для Каждого Стр Из Объект.СписокНоменклатуры Цикл			
		Стр.Цена = ПолучитьЦенуНоменклатуры(Стр.Номенклатура);
		Стр.Сумма = Стр.Количество * Стр.Цена;
	КонецЦикла;
		
КонецПроцедуры
