		   
Процедура ЗагрузитьКурсыВалют() Экспорт
	
	HTTPСоединение = Новый HTTPСоединение("www.cbr-xml-daily.ru", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL, Неопределено); 
        
	Заголовки   = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	
	HTTPЗапрос = Новый HTTPЗапрос("latest.js", Заголовки);
	
	Попытка
        Результат =  HTTPСоединение.Получить(HTTPЗапрос); 
        Тело = Результат.ПолучитьТелоКакСтроку(); 
       Исключение
         // исключение здесь говорит о том, что запрос не дошел до HTTP-Сервера
         Сообщить("Произошла сетевая ошибка!");
         Возврат;
     КонецПопытки;
	 
	ДанныеВалют = JSONВСтруктуру(Тело);
	
	СтруктураВалют = ДанныеВалют.rates;
	
	документОбъект = Документы.УстановкаКурсовВалют.СоздатьДокумент();
	документОбъект.Дата = НачалоДня(ТекущаяДатаСеанса());
	
	Для Каждого КлючЗначение Из СтруктураВалют Цикл
		
		ВалютаСсылка = Справочники.Валюты.НайтиПоКоду(КлючЗначение.Ключ);
		
		Если ВалютаСсылка = Справочники.Валюты.ПустаяСсылка() Тогда
			ВалютаОбъект = Справочники.Валюты.СоздатьЭлемент();
			ВалютаОбъект.Наименование = КлючЗначение.Ключ;
			ВалютаОбъект.Код = КлючЗначение.Ключ;
			ВалютаОбъект.Записать();
			
			ВалютаСсылка = ВалютаОбъект.Ссылка;
		КонецЕсли;
		
		Стр = документОбъект.Валюты.Добавить();
		Стр.Валюта = ВалютаСсылка;
		Стр.Курс =  ?(КлючЗначение.Значение = 0, 0, 1/КлючЗначение.Значение);
		
	КонецЦикла;

	Попытка
		документОбъект.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция JSONВСтруктуру(Знач ОтветСтрока) Экспорт
	
	ЧтениеJSON	= Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ОтветСтрока);	
	данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат данные;
	
КонецФункции
