#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ОтпускаСотрудников КАК ОтпускаСотрудников
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	ДатаНачала";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОтпускаСотрудников.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
	УстановитьНастройкиОформления();
	ПостроитьДиаграммуГанта();
	 
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементов

&НаСервере
Процедура ДиаграммаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	УстановитьТекстЗначения(Интервал.Значение.Текст, Интервал.Начало, Интервал.Конец);	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьДиаграмму(Команда)	
	СохранитьВPNG();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДиаграмму(Команда)
	ПостроитьДиаграммуГанта();
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	Для Каждого Точка Из Диаграмма.Точки Цикл 
		Диаграмма.РазвернутьТочку(Точка, Истина);		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	Для Каждого Точка Из Диаграмма.Точки Цикл 
		Диаграмма.СвернутьТочку(Точка, Истина);		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьНастройкиОформления()
	  
	Диаграмма.ОтображениеИнтервала = ОтображениеИнтервалаДиаграммыГанта.Объемный;
	
	Диаграмма.ВертикальнаяПрокрутка = Истина;
	Диаграмма.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.НеОтображать;
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуГанта() 
	
	Связи = Новый ТаблицаЗначений;
	Связи.Колонки.Добавить("Интервал");	
	
	Диаграмма.Очистить();
	
	СерияПлан = Диаграмма.Серии.Добавить();
	СерияПлан.Текст = "Отпуска сотрудников";
	СерияПлан.Цвет = WebЦвета.СинеФиолетовый;
	
	ДобавитьДемоИнтервалы(СерияПлан);
	

	Для Каждого СтрокаТЧОтпуска Из ОтпускаСотрудников Цикл 
		
		Точка = Диаграмма.УстановитьТочку(СтрокаТЧОтпуска.Сотрудник, "Отпуска сотрудников"); // Родитель = "Демо"
		
		Точка.Текст = СтрокаТЧОтпуска.Сотрудник;
		Точка.Картинка = БиблиотекаКартинок.Реквизит;			
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, СерияПлан);
		Значение.Редактирование = Истина;
		
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаТЧОтпуска.ДатаНачала;
		Интервал.Конец = СтрокаТЧОтпуска.ДатаОкончания;
		Интервал.Текст = "Дата отпуска";
		
		УстановитьТекстЗначения(Значение.Текст, СтрокаТЧОтпуска.ДатаНачала, СтрокаТЧОтпуска.ДатаОкончания);   
		
	КонецЦикла;
		
	Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[1];
	
	МеткаВремени = Шкала.Метки.Добавить(НачалоДня(ТекущаяДата()));
	МеткаВремени.Текст = "Текущая дата " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	МеткаВремени.ЦветТекста = WebЦвета.Красный;				
	МеткаВремени.ЦветЛинии = WebЦвета.Красный;
	
	ТекущийПериод = НачалоМесяца(Диаграмма.НачалоПолногоИнтервала - 1);
	КонечныйПериода = Диаграмма.КонецПолногоИнтервала;
	
	Пока ТекущийПериод < КонечныйПериода Цикл 
		Если КонецНедели(ТекущийПериод) = КонецДня(ТекущийПериод) Тогда 
			ИнтервалФона = Диаграмма.ИнтервалыФона.Добавить(НачалоДня(ТекущийПериод - 86400), КонецДня(ТекущийПериод));
			ИнтервалФона.Цвет = WebЦвета.БледноЛиловый;
		КонецЕсли;
		
		ТекущийПериод = КонецДня(ТекущийПериод) + 1;	
	КонецЦикла;
	
	Точка = Диаграмма.УстановитьТочку("Отпуска сотрудников");
	Диаграмма.РазвернутьТочку(Точка, Истина);   
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДемоИнтервалы(Серия)
		
	Точка = Диаграмма.Точки.Добавить();
	Точка.Текст = "Отпуска сотрудников";
	Точка.Значение = "Отпуска сотрудников";
	Точка.Картинка = БиблиотекаКартинок.СводнаяДиаграмма;
	
	
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
	ТекущийПериод = НачалоГода(ТекущаяДата());
	
	Для Итерация = 1 По 25 Цикл 
		
		ЦветИнтервала = Новый Цвет(Итерация * 10, Итерация * 10, Итерация * 10);
		
		Интервал = Значение.Добавить();
		Интервал.Цвет = ЦветИнтервала;
		Интервал.Начало = НачалоДня(ТекущийПериод);
		Интервал.Конец = КонецДня(ТекущийПериод);
			
		
		ТекущийПериод = КонецДня(ТекущийПериод) + 1;
	КонецЦикла;
		
	Палира = Новый Массив;
	Палира.Добавить(WebЦвета.Красный);
	Палира.Добавить(WebЦвета.Оранжевый);
	Палира.Добавить(WebЦвета.Желтый);
	Палира.Добавить(WebЦвета.Зеленый);
	Палира.Добавить(WebЦвета.Голубой);
	Палира.Добавить(WebЦвета.Синий);
	Палира.Добавить(WebЦвета.Фиолетовый);
	
	Для Итерация = 0 По 6 Цикл 
		
		Интервал = Значение.Добавить();
		Интервал.Цвет = Палира[Итерация];
		Интервал.Начало = НачалоДня(ТекущийПериод);
		Интервал.Конец = КонецДня(ТекущийПериод);
				
		
		ТекущийПериод = КонецДня(ТекущийПериод) + 1;
	КонецЦикла;
				
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстЗначения(Текст, ДатаНачала, ДатаОкончания)
	Текст = Формат(ДатаНачала, "ДЛФ=DDT") + " - " + Формат(ДатаОкончания, "ДЛФ=DDT");	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВPNG()
	
	Картинка = Диаграмма.ПолучитьКартинку(2000, 1000, ФорматКартинки.PNG);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Выберите имя файла для сохранения";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Документ PNG (*.png)|*.png";
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
		Картинка.Записать(ИмяФайла);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти




